JMeter/jmeter_scripts/jmeter.log
2017/07/10 11:33:21 INFO  - jmeter.util.JMeterUtils: Setting Locale to en_US 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/3.1/libexec/bin/user.properties 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/3.1/libexec/bin/system.properties 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Setting JMeter property: UserThreads=32 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Copyright (c) 1998-2016 The Apache Software Foundation 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Version 3.1 r1770033 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: java.version=1.8.0_131 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: os.name=Mac OS X 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: os.arch=x86_64 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: os.version=10.12.5 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: file.encoding=UTF-8 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Max memory     =514850816 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Available Processors =8 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: Default Locale=English (United States) 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: JMeter  Locale=English (United States) 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: JMeterHome=/usr/local/Cellar/jmeter/3.1/libexec 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: user.dir  =/Users/priceb/Development/Workspaces/AnypointStudio/GatesOSS/interop-performance/JMeter/jmeter_scripts 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: PWD       =/Users/priceb/Development/Workspaces/AnypointStudio/GatesOSS/interop-performance/JMeter/jmeter_scripts 
2017/07/10 11:33:21 INFO  - jmeter.JMeter: IP: 10.0.1.8 Name: Brians-MacBook-Pro.local FullName: 10.0.1.8 
2017/07/10 11:33:21 INFO  - jmeter.services.FileServer: Default base='/Users/priceb/Development/Workspaces/AnypointStudio/GatesOSS/interop-performance/JMeter/jmeter_scripts' 
2017/07/10 11:33:21 INFO  - jmeter.services.FileServer: Set new base='/Users/priceb/Development/Workspaces/AnypointStudio/GatesOSS/interop-performance/JMeter/jmeter_scripts' 
2017/07/10 11:33:22 INFO  - jmeter.save.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2 
2017/07/10 11:33:22 INFO  - jmeter.save.SaveService: Using SaveService properties file encoding UTF-8 
2017/07/10 11:33:22 INFO  - jmeter.save.SaveService: Using SaveService properties version 3.1 
2017/07/10 11:33:22 INFO  - jmeter.save.SaveService: All converter versions present and correct 
2017/07/10 11:33:22 INFO  - jmeter.save.SaveService: Loading file: apikit-performance-comparison-with-apikit.jmx 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser 
2017/07/10 11:33:22 INFO  - jmeter.JMeter: Creating summariser <summary> 
2017/07/10 11:33:22 INFO  - jmeter.engine.StandardJMeterEngine: Running the test! 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleEvent: List of sample_variables: [] 
2017/07/10 11:33:22 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must contain the string: '.functions.' 
2017/07/10 11:33:22 INFO  - jmeter.engine.util.CompoundVariable: Note: Function class names must not contain the string: '.gui.' 
2017/07/10 11:33:22 INFO  - jmeter.JMeter: Running test (1499708002204) 
2017/07/10 11:33:22 INFO  - jmeter.engine.StandardJMeterEngine: Starting ThreadGroup: 1 : ILP Ledger Adapter Tests - CSV based - Thread Group 
2017/07/10 11:33:22 INFO  - jmeter.engine.StandardJMeterEngine: Starting 32 threads for group ILP Ledger Adapter Tests - CSV based - Thread Group. 
2017/07/10 11:33:22 INFO  - jmeter.engine.StandardJMeterEngine: Thread will start next loop on error 
2017/07/10 11:33:22 INFO  - jmeter.threads.ThreadGroup: Starting thread group number 1 threads 32 ramp-up 4 perThread 125.0 delayedStart=false 
2017/07/10 11:33:22 INFO  - jmeter.threads.ThreadGroup: Started thread group number 1 
2017/07/10 11:33:22 INFO  - jmeter.engine.StandardJMeterEngine: All thread groups have been started 
2017/07/10 11:33:22 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-1 
2017/07/10 11:33:22 INFO  - jmeter.services.FileServer: Stored: data/customerPerformanceTestingData_360000-recs.csv Alias: data/customerPerformanceTestingData_360000-recs.csv@293002476 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPHCAbstractImpl: Local host = Brians-MacBook-Pro.local 
2017/07/10 11:33:22 INFO  - jmeter.protocol.http.sampler.HTTPHC4Impl: HTTP request retry count = 0 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleResult: Note: Sample TimeStamps are START times 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleResult: sampleresult.default.encoding is set to ISO-8859-1 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleResult: sampleresult.useNanoTime=true 
2017/07/10 11:33:22 INFO  - jmeter.samplers.SampleResult: sampleresult.nanoThreadSleep=5000 
2017/07/10 11:33:22 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-2 
2017/07/10 11:33:22 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-3 
2017/07/10 11:33:22 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-4 
2017/07/10 11:33:22 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-5 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-6 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-7 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-8 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-9 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-10 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-11 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-12 
2017/07/10 11:33:23 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-13 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-14 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-15 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-16 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-17 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-18 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-19 
2017/07/10 11:33:24 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-20 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-21 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-22 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-23 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-24 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-25 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-26 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-27 
2017/07/10 11:33:25 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-28 
2017/07/10 11:33:26 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-29 
2017/07/10 11:33:26 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-30 
2017/07/10 11:33:26 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-31 
2017/07/10 11:33:26 INFO  - jmeter.threads.JMeterThread: Thread started: ILP Ledger Adapter Tests - CSV based - Thread Group 1-32 
2017/07/10 11:33:30 INFO  - jmeter.reporters.Summariser: summary +   3738 in 00:00:08 =  479.4/s Avg:    47 Min:     2 Max:   247 Err:     0 (0.00%) Active: 32 Started: 32 Finished: 0 
2017/07/10 11:34:00 INFO  - jmeter.reporters.Summariser: summary +  23510 in 00:00:30 =  783.7/s Avg:    40 Min:     2 Max:   171 Err:     0 (0.00%) Active: 32 Started: 32 Finished: 0 
2017/07/10 11:34:00 INFO  - jmeter.reporters.Summariser: summary =  27248 in 00:00:38 =  720.9/s Avg:    41 Min:     2 Max:   247 Err:     0 (0.00%) 
2017/07/10 11:34:05 INFO  - jmeter.reporters.ResultCollector: Shutdown hook started 
2017/07/10 11:34:05 INFO  - jmeter.reporters.ResultCollector: Shutdown hook ended